type DivisionAndMatchType = Record<string, string>;

export const division: DivisionAndMatchType = {
	800: "슈퍼챔피언스",
	900: "챔피언스",
	1000: "슈퍼챌린지",
	1100: "챌린지 1",
	1200: "챌린지 2",
	1300: "챌린지 3",
	2000: "월드클래스 1",
	2100: "월드클래스 2",
	2200: "월드클래스 3",
	2300: "프로 1",
	2400: "프로 2",
	2500: "프로 3",
	2600: "세미프로 1",
	2700: "세미프로 2",
	2800: "세미프로 3",
	2900: "유망주 1",
	3000: "유망주 2",
	3100: "유망주 3",
};

export const matchType: DivisionAndMatchType = {
	30: "리그 친선",
	40: "클래식 1on1",
	50: "공식경기",
	52: "감독모드",
	60: "공식 친선",
	204: "볼타 친선",
	214: "볼타 공식",
	224: "볼타 AI대전",
	234: "볼타 커스텀",
};
